app/controllers/smily_controller.rb

INSERT INTO `smilies` (`mood`, `created_at`, `updated_at`) VALUES('littsur', '2009-02-02 15:59:48', '2009-02-02 15:59:48')
---
  def create
    Smily.create!(params[:smily])

SELECT * FROM `smilies`
---
  def index
    @smilys = Smily.find :all